PRO WCF 4 Final Code/Chapter 13/MtomTest/Captures/5.txt


--uuid:726aa6e7-5ac8-49f4-8582-b7ba097be859+id=3
Content-ID: <http://tempuri.org/0>
Content-Transfer-Encoding: 8bit
Content-Type: application/xop+xml;charset=utf-8;type="application/soap+xml"

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><s:Header><a:Action s:mustUnderstand="1" u:Id="_2">http://tempuri.org/IMtomSample/GetFile</a:Action><a:MessageID u:Id="_3">urn:uuid:319b1258-2dd9-4b48-a0fc-a2d32f6a195b</a:MessageID><a:ReplyTo u:Id="_4"><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1" u:Id="_5">http://xpshawnci:8080/MtomService</a:To><o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><u:Timestamp u:Id="uuid-af1f0d7a-6fd7-4c06-9ce0-7a5acb18669f-4"><u:Created>2006-06-14T17:04:18.421Z</u:Created><u:Expires>2006-06-14T17:09:18.421Z</u:Expires></u:Timestamp><c:SecurityContextToken u:Id="uuid-1d08b8c1-0a69-4151-809d-e5ebecd21a4b-5" xmlns:c="http://schemas.xmlsoap.org/ws/2005/02/sc"><c:Identifier>urn:uuid:b05076ed-a161-495d-bf39-64092e38783f</c:Identifier></c:SecurityContextToken><c:DerivedKeyToken u:Id="_0" xmlns:c="http://schemas.xmlsoap.org/ws/2005/02/sc"><o:SecurityTokenReference><o:Reference ValueType="http://schemas.xmlsoap.org/ws/2005/02/sc/sct" URI="#uuid-1d08b8c1-0a69-4151-809d-e5ebecd21a4b-5"/></o:SecurityTokenReference><c:Offset>0</c:Offset><c:Length>24</c:Length><c:Nonce>gWw9u/vNEK/NL4NU9YkI7w==</c:Nonce></c:DerivedKeyToken><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/><Reference URI="#_2"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>rFyrBgKk0UpkWSqnoJtU26wl13Y=</DigestValue></Reference><Reference URI="#_3"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>dzgKT/ylbzBWUpO/GQZsCq7RMxU=</DigestValue></Reference><Reference URI="#_4"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>l6mMmQ2LE9VFtjaA6Qc4GKBXURw=</DigestValue></Reference><Reference URI="#_5"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>j+u2OowPNuuAgCH/6NFN3SCvWcE=</DigestValue></Reference><Reference URI="#uuid-af1f0d7a-6fd7-4c06-9ce0-7a5acb18669f-4"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>+NS1tj2Ln67IPKsot2U5NQPe1ko=</DigestValue></Reference></SignedInfo><SignatureValue>TQam01CZ8GCOpA9VFw7lwS2sldQ=</SignatureValue><KeyInfo><o:SecurityTokenReference><o:Reference URI="#_0"/></o:SecurityTokenReference></KeyInfo></Signature></o:Security></s:Header><s:Body><GetFile xmlns="http://tempuri.org/"><fileName>LogoText.JPG</fileName></GetFile></s:Body></s:Envelope>
--uuid:726aa6e7-5ac8-49f4-8582-b7ba097be859+id=3--
